import reg
from polymer import Polymer

IntentName = 'HELP2'


# <base>

我     = Polymer(['我'])
需要   = Polymer(['需要', '想要', '要'])
我需要 = Polymer(我.OR(), 需要) 
一份   = Polymer(['一份', '一个', '份'])
使用   = Polymer(['使用', '操作', '用'])
帮助   = Polymer(['帮助', '说明', '手册', '例句', '操作手册', '操作说明', '帮助文档', '帮助手册', '指导'])
了解   = Polymer(['了解', '知道', '明白', '搞清楚', '弄清楚', '弄明白'])
吧     = Polymer(['吧'])
啊     = Polymer(['啊', '呀'])

给我   = Polymer(['给我', '能给我', '能发我', '发我', '给', '发'])
怎么   = Polymer(['怎么', '怎样', '如何', '该如何', '我应该怎么', '应该怎么', '应该如何', '我该怎么', '我该如何', '我应该如何', '我如何', '我怎么', '我要怎么', '我要如何'])
小助手 = Polymer(['小助手', '机器人', '这', '这东西', '这玩意儿', '这玩意', '这家伙'])

# </base>


reg.AddRules(
    IntentName,
	Polymer(我需要.OR(), 一份.OR(), 使用.OR(), 帮助, 吧.OR()),
	Polymer(我需要.OR(), 了解.OR(), 怎么, 使用, 啊.OR()),
	Polymer(小助手, 需要.OR(), 怎么, 使用, 啊.OR()),
	Polymer(Polymer(我需要, 了解).OR(), 小助手, 怎么, 使用, 啊.OR()),
	Polymer(给我, 一份.OR(), 帮助, 吧.OR()),
	Polymer([
		'求助', '求指导', '求救', '帮帮忙', '拜托',
		'行不行啊', '真难用啊', '好难用啊','太难用了', '一点都不好用', '不好用',
		'太差了', '差劲', '不行啊', '太烂了', '真烂', 
		'根本不能用啊', '不喜欢你', '废物', '难用', '垃圾',
	]),
)
